Catalogs/ТочкиДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТочкиДоставки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Партнеры</xr:Item>
				<xr:Item>Catalog.Склады</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОсновнаяТочка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЗначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторАдреса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПереопределен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторТочкиДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ТочкиДоставки/Forms/ФормаСписка/Ext/Form/Module.bsl
//@strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	УстановитьДоступностьКомандыАрхивации();

	ДоставкаТоваровКлиентСервер.ИзменитьОтборАктуальныхТочек(ЭтотОбъект);
	
	СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтображатьНеиспользуемые(Команда)
	
	ДоставкаТоваровКлиентСервер.ИзменитьОтборАктуальныхТочек(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПризнакИспользования(Команда)
	
	ОчиститьСообщения();
	
	ВыделенныеСтроки = ОбщегоНазначенияУТКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.Список); // Массив из СправочникСсылка.ТочкиДоставки
	
	Для Каждого ТекущаяТочка Из ВыделенныеСтроки Цикл
		
		ТекущиеДанные = Элементы.Список.ДанныеСтроки(ТекущаяТочка);
		
		Если НЕ ТекущиеДанные.НеИспользуется
		   И ТекущиеДанные.ОсновнаяТочка Тогда
			
			ШаблонСообщения = НСтр("ru = 'Невозможно отключить использование: точка доставки ""%1"" является основным адресом доставки'");
			ПредставлениеТочки = Строка(ТекущиеДанные.Ссылка);
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонСообщения,
				ПредставлениеТочки);
				
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, ТекущиеДанные.Ссылка);
			
		Иначе
			
			НовыйПризнак = НЕ ТекущиеДанные.НеИспользуется;
			ИзменитьПризнакИспользованияТочкиДоставки(ТекущаяТочка, НовыйПризнак);
			ОповеститьОбИзменении(ТекущаяТочка);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Список.УсловноеОформление.Элементы.Очистить();
	ДоставкаТоваров.УстановитьОформлениеНеиспользуемыхТочекДоставки(Список);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьПризнакИспользованияТочкиДоставки(Знач ТочкаДоставки, Знач НеИспользуется)
	
	ТочкаОбъект = ТочкаДоставки.ПолучитьОбъект();
	ТочкаОбъект.НеИспользуется = НеИспользуется;
	ТочкаОбъект.Записать();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьКомандыАрхивации()
	
	Если НЕ ПравоДоступа("Изменение", Метаданные.Справочники.ТочкиДоставки) Тогда
		
		ИменаЭлементов = Новый Массив; // Массив из Строка
		ИменаЭлементов.Добавить(Элементы.ФормаИзменитьПризнакИспользования.Имя);
		ИменаЭлементов.Добавить(Элементы.СписокКонтекстноеМенюИзменитьПризнакИспользования.Имя);
		
		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ИменаЭлементов, "Видимость", Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
